The connector is invalid, the size cannot be determined from the connector.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InvalidConnector { get; }
  Visual Basic
Public Shared ReadOnly Property InvalidConnector As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InvalidConnector {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConnectorFailures Class
  Autodesk.Revit.DB Namespace